app/controllers/application_controller.rb

SELECT "parents".* FROM "parents" WHERE "parents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
def current_user
    decoded_token = decode_token()
    if decoded_token
        user_id = decoded_token[0]['user_id']
        params['role'] === "Teacher" ? user === Teacher.find_by(id: user_id) : user === Parent.find_by(id: user_id)