app/controllers/attendances_controller.rb

    def index
        render json: Attendance.all
---
SELECT "attendances".* FROM "attendances"

    def create
        attendance = Attendance.create!(permitted_params)
---
INSERT INTO "attendances" ("classroom_id", "student_id", "student_name", "status", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)