app/controllers/auth_controller.rb

    def create
        user = Teacher.find_by(email: params[:email])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."email" = ? LIMIT ?  [["email", "timothy@gmail.com"], ["LIMIT", 1]]