app/controllers/classrooms_controller.rb

    def index
        render json: Classroom.all
---
SELECT "classrooms".* FROM "classrooms"

    def show
        classroom = Classroom.find(params[:id])
---
SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]