app/controllers/disciplines_controller.rb

SELECT "disciplines".* FROM "disciplines"
---
    def index
        render json: Discipline.all

SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_by_id
        Discipline.find(params[:id])