app/controllers/parent_students_controller.rb

    def index
        render json: ParentStudent.all
---
SELECT "parent_students".* FROM "parent_students"

    def create
        parent_student = ParentStudent.create!(parent_student_params)
---
INSERT INTO "parent_students" ("parent_id", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["parent_id", 6], ["student_id", 5], ["created_at", "2023-01-16 08:31:42.758935"], ["updated_at", "2023-01-16 08:31:42.758935"]]