app/controllers/parent_auth_controller.rb

    def create
        byebug
        parent = Parent.find_by(phone_number: params[:phone_number])
---
SELECT "parents".* FROM "parents" WHERE "parents"."phone_number" = ? LIMIT ?  [["phone_number", "743564786"], ["LIMIT", 1]]