app/controllers/parents_controller.rb

    def index
        parents = Parent.all
---
SELECT "parents".* FROM "parents"

    def create
        parent = Parent.create!(parent_params)
---
INSERT INTO "parents" ("first_name", "last_name", "phone_number", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def find_parent
        Parent.find_by(id: params[:id])
---
SELECT "parents".* FROM "parents" WHERE "parents"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]