app/controllers/students_controller.rb

        def show
        student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

        def create
        student = Student.create!(student_params)
---
INSERT INTO "students" ("first_name", "second_name", "surname", "age", "description", "admission_number", "classroom_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

        def destroy
            student = Student.find(params[:id])
            student.destroy
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 2]]