app/controllers/teachers_controller.rb

    def index
        teachers = Teacher.all
---
SELECT "teachers".* FROM "teachers"

    def find_teacher
        Teacher.find_by(id: params[:id])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]